<?php
return [
	'shu'=>[
		'xi'=>'金水相生：铭、钻、钧、铜、钰、永、浚、浩、清…… 金生子水，水水比旺，有贵人有助力，被疼惜被宠爱，受益良多。
申辰三合：绅、珅、祺、宗、宸、振、麒、麟、珑、谦、谅、贻…… 申子辰三合，合水为智，智慧高于常人，心思细腻，贵人多助。
亥丑三会：家、豪、豫、钮、纽、妞…… 亥子丑三会，心手相连，互信互助，贵人常现，旺己旺人。
大王得位：冠、帝、首、君、琪、珮、玲、珍、瑜、玮…… 得位则气势凌人，领导力强，掌权得势，多做多牢，受人敬重。
彩衣得势：市、表、裕、裳、常、席、綵、统、纬、绮…… 得势则人缘特好，心情开阔、桃花多多，左右逢源，得势得力。
五谷得食：禾、秉、科、程、登、丰、颖、廉、精、蓁…… 得食则丰衣足食，福禄财旺，满足称心，如鱼得水，心想事成。
洞穴得地：台、呈、宏、宇、安、、广、同、向、和、品…… 得地则心安无虑，感情对位，钱财稳定，运途平顺，少灾多福。',
		'ji'=>'子午对冲：骏、驰、馴、驻、骐、腾、骅、骋、赤、夏、南…… 子午冲水火难容，感情路来去匆匆，六神无主心何从，运势难开祸多重。
卯酉破克：卿、月、勉、逸、凤、雅、集、鹏、翊、菲、鸿、雄…… 子卯相刑子酉破，刑克破害情难过，婚姻难全小人多，有志难伸常犯错。
子未六害：洋、祥、翔、善、羚、群、义、妹、仪、曦…… 六害如尖刀子弹，情路难走刀穿肠，人生行运多磨难，身心难熬多刑伤。
逢日刑伤：昌、晶、明、旭、昱、易、昆、晓、光、辉、照…… 多情总被无情伤，妻管严男人难当，垂头丧气内心苦，战战兢兢难享福。
逢人蛇刑克害：仁、仕、仲、佑、佳、伊、建、迎、通、连、强…… 刑害刑克多意外，计划没有变化快，伤心伤身无人睬，伤情破财更无奈。
逢肉站立惊险：心、蕊、慈、志、胜、腾、立、昱、翊、竣…… 老鼠吃肉有桃花，心性不定情乱抓，心惊胆跳常害怕，有福难享财运差。
逢土被克：圳、地、均、在、奎、佳、堂、坤、城、坚、尧…… 土克子水必伤肾，欲振乏力志消沉，有志难伸只能忍，一生受制事难成。
逢火伤克：炎、烈、然、煌、焜、照、燕、灿、煜、焕、炫…… 子水克火正冲克，伤情耗财种罪恶，眼目有疾有车关，意外血光剪不断。
逢木生泄：材、桃、格、根、桂、桐、栋、棋、榆、松、楷、荣……
付出总比得到多，感情钱财躲不过，天天有人来提货，事半功倍徒奈何。'
	],
	'niu'=>[
		'xi'=>'牛喜欢有洞穴住，喜欢吃五谷杂粮，如能得水得木得草最佳，得蛇得鸡成三合局，得鼠得猪成三会局，得田符合属性，得栅栏得休息—名字中如有符合下述条件者为好名。
一. 有「艹」字部首的字对牛很好，因牛以草为主食，名字有艹字部，代表粮食丰富，内心世界充实，一生吃穿不虞匮乏，不怕饿肚子啦。
二.有「宀」、「广」、「门」、「户」部的字，代表牛可在屋檐下休息，有温暖的家，表一生比较不会那么辛苦。
三.有「田」、「甫」、「原」的字根，牛在田野，吃草或耕田，都适得其所，悠哉享受美食，或勤劳耕田，尽其牛的本份，任劳任怨，如有田部旁叫作很棒。
四.牛以素食主粮，如有「禾」、「叔」、「菽」、「麦」、「稻」、「豆」的字根，则可得温饱，属牛者名字中，如有以上字根，表示粮食丰盛，不虞吃穿，这辈子穷不了。
五.有「辶」的部首，其形象似蛇。及有「酉」、「鸟」、「羽」的部首可得三合局，因为「巳、酉、丑」为三合，即牛与蛇、鸡称「三合」，互有帮助，一生中贵人多。
六.三会部首喜遇「亥」、「家」、「豪」、「子」、「季」、「存」、「淳」.....等字互有帮助，遇事能迎刃而解。',
		'ji'=>'属牛之人不喜欢字有人字边，或肉字边，或马字边，或羊字边，或狗字边，或龙字形，也不喜披彩衣变漂亮，也不喜得王、掌权，或戴王冠，或持武器，或有奔跑之字形，如果名字中有以上所举例之字形，就表示名字有破格。
		一.属牛之人避免用「心」、「月」、「忄」的部首，因为那是肉的偏旁主荤食也。牛不食荤，如果肖牛者，名字有肉的偏旁者，便易有食不下咽的感觉，有精神被掠夺的味道，以及失落感。
		二.属牛之人避免有「日」、「山」的部首，因为牛在太阳下耕作，变成「气喘牛」。牛走山路也很辛苦，牛上山头步履维艰，表一生中较劳禄。
		三.属牛之人避免有「王」、「玉」、「主」、「君」、「帝」、「大」、「长」、「冠」的部首，人怕出名猪怕肥，牛也忌肥大，牛猪逢大有祭天的味道，虽然有祭天的荣耀，但其牺牲的代价太高了。牛太大时，易成为牺牲品，做到流汗被人嫌到流口水。
		四.避免有「示」之字根。「示」，意为祭祀，自古以来，以牛、羊、猪祭天，身为牛牺牲自己，以生命换来荣耀，代价未免太高了，表从小就很辛苦了。
		五.属牛之人避免用「羊」的部首，因为牛与羊为「对冲」，即丑与未对冲，容易有生离死别的迹象，以及不如意之事发生。
		六.属牛之人避免用「马」的部首，因为「牛头不对马嘴」，「风马牛不相及」，牛与马相刑，表一生与人意见不合。
		七.属牛之人避免有「彡」、「巾」、「衣」、「采」、「示」、「系」的部首，为披彩衣之象。牛如果披上彩衣，不是变成祭品，就是一生为别人无怨无悔地付出，直到老死为止。'
	],
	'hu'=>[
		'xi'=>'老虎喜欢有洞穴住，如能得山部，披彩衣为佳，能得王掌权最佳，又戴冠，吃肉最棒，能得水得木得森林更好，得马得狗三合局，有奔跑字形更有前途—名字中如有符合下述条件者为好名。
		一. 虎喜有「肉」、「月」、「心」、「忄」之字根，因老虎为肉食性动物，有以上字根，表示粮食丰富，内心充实，体力佳，一生不愁吃穿。
		二.虎喜欢有「卯」、「东」之字根，因寅、卯、辰为三会，合成木局，一生得贵人相助。
		三. 虎喜欢有「氵」、「水」、「冫」之字根，因为水能生寅( 虎 ) 生木能得助力，受人提拔。
		四.虎喜欢有「衣」、「系」、「巾」、「采」之字根，可华丽老虎之身，增加其威风俊秀，表是一生受人尊重。
		五.虎喜欢有武器随身，代表虎牙、虎爪如：「矢」、「斤」、「戈」一生拥有好本领。
		六.如有「山」、「林」、「木」之字根，为老虎适得其所之意，因老虎大都栖息在森林，又称森林之王，可以让老虎充分发挥其潜能。
		七.如有「王」、「君」、「令」、「大」、「将」、「力」之字根，老虎为森林之王，并喜发号司令，可掌大权，有威权之意，一生为老板或主管格局。
		八.老虎如遇「马」、「午」、「南」、「腾」、「火」、「戌」、「然」、「犬」、「献」之字根即成三合局，因寅、午、戌成三合，能互相帮助，贵人多且有助之意。
',
		'ji'=>'属虎之人不喜欢字有人字边就像
( 人见老虎就怕 )，不吃五谷杂粮，遇蛇、遇猴成三刑，也不喜开口字形，不宜见草原或平地字形 ( 虎落平阳被犬欺)
一.属虎之人避免有「田」的字根，因为老虎入「艹」原及到「田」间，都有「虎落平阳被犬欺」之意，一生中总会被人欺负。
二.属虎之人避免有小「口」、大「口」的字根，因为老虎开口，便伤人，以及老虎有受困之感，不易展现其威，一生志向无法发挥
三.属虎之人避免有「门」、「栅」、「栏」之字根，老虎被关在家里，不易展其威势之感。
四.属虎之人避免有「小」、「士」、「臣」、「幼」的字根，老虎宜大，才有威风，称「小」就变成病猫，会有体弱多病的感觉。
五.属虎之人避免有「示」之字根，因为老虎进不了宗庙、祠堂，表不登对，会没人缘。
六.属虎之人避免有「虎」之字根，因为「一山不容两虎」，会有言词伤人的味道。
七. 属虎之人避有「申」、「袁」、「侯」的字根，因为 「寅」 与「申」 正冲，表一生会与人对立。
八.属虎之人避免有蛇的字根，如「一」、「｜」、「邑」、「虫」、「虹」、「强」、「远」。因为「寅」与「巳」相刑害，「蛇遇猛虎似刀戳」，一生小人特多。
九.属虎之人避免有「人」 或 「ㄔ」的字根，因为老虎不喜欢被人控制，也会被人所伤。
十.属虎之人避免有「日」、「光」的字根，因为老虎不喜在大太阳下，因为会很辛苦。'
	],
	'tu'=>[
		'xi'=>'兔子喜欢有洞穴住，披彩衣为佳，有五谷得温饱，能得水、得木、得森林、得草为适得其所，如有羊或猪之形为三合局，得栅栏可休息—名字中如有符合下述条件者为好名。
一.兔子喜欢名字中有小「口」、大「口」、「宀」、「冖」之字根，因狡兔三窟，兔子喜欢在洞穴里窜来窜去，有个安全的家，一生食禄，财禄不缺。但「安」、「宇」两字除外。
二.名字宜用有「寅」、「虎」、「嵩」、「丘」、「良」、「献」之字根，因寅、卯、辰为三会局可得贵人助。
三.名字宜用有「彡」、「系」、「衣」、「采」、「巾」、「示」之字根，兔子着重有漂亮的毛色，可华丽其外表，可得人缘，受人喜欢。四.名字喜有「木」、「水」之字根，水生木可得贵人相助，因「木」属东方，「卯」亦为木，有见到自己同类的感觉。
五.名字宜有「艹」之字根，因兔子为素食动物，凡事能得心应手。
六.名字宜有「禾」、「米」、「豆」、「麦」、「梁」、「稷」、「稻」、「叔」，以上均为五谷杂粮，为属兔者喜用之字根，可得温饱，一生中做什么像什么。
七.名字宜有「亥」、「核」、「未」、「善」的字根，因亥、卯、未三合，兔子与猪、羊称三合，有帮扶之意，一生贵人特多。
',
		'ji'=>'属兔之人不喜欢字有人字边，或肉字边，也不喜得王、掌权，或戴王冠，或持武器，或有奔跑之字形，遇龙则成相害，遇鸡是六冲，更不愿见日字形，太劳累，如果名字中有以上所举例之字形，就表示名字有破格。
一.属兔之人避免选用有「日」、「阳」之字根，因为犯了日月冲之象，兔又代表「月」兔，遇有「日」的字根，则会日月对冲，容易与人对立。
二.属兔之人避免选用有「人」的字根，俗云：「守株待兔」表生活恐惧，一生不安，危机四伏。
三.属兔之人避免选用有「大」、「君」、「冠」、「帝」、「王」之字根，因兔子为小动物，无福称「大」、称「王」会有压力过重，承担不起之感。
四.属兔之人避免选用有「山」、「林」、「艮」之字根，因为兔子若处在森林、山中，日子过得比较惊心动魄，时时有危机，弱肉强食的原则下，兔子常成为其它动物的美餐。
五.属兔之人避免用有「心」、「月」、「忄」之字根，是代表「荤食」然而兔子是草食动物，见到「肉」会有失落感，看得到而吃不得也，凡事不能顺心。
六.属兔之人避免用有「辰」、「龙」、「贝」、「子」之字根，因为与地支卯辰相害三刑，没有助力，人际关系差。
七.属兔之人避免选用有「酉」、「西」、「鸡」、「金」字根，因以上诸字根均代表西方「卯」与「酉」对冲，表示一生中无助力，做什么都不对。'
	],
	'long'=>[
		'xi'=>'龙喜欢得日月精华，披彩衣为佳，能得王掌权最佳，又戴冠，得水最棒，能天上飞，能得鼠、得猴，成三合局—名字中如有符合下述条件者为好名。
一. 宜选用有「氵」、「水」之字根，因龙喜水，龙得水，亦适得其所，一生能发挥所长，做什么像什么。
二.名字宜有「王」、「大」、「君」、「主」、「帝」、「一」、「令」、「主」、「长」、「上」、「首」、「天」之字根，因龙在中国人心中的地位为最大，宜称「龙王」，发号司令，不宜称小，表一生能成为别人的贵人，受人尊敬。
三.宜选用有「申」、「爰」、「袁」、「子」、「马」、「午」、「凤」之字根，因申、子、辰三合，龙与猴、鼠为三合局，因龙与马在一起，会有「龙马精神」、「龙飞凤舞」的干劲，会积极努力开创前程。
四.宜选用有抬头的字根，如「ㄊ」、「爫」「亠」，因龙喜欢抬头，可展露其威，容易成为领导人。
五.名字宜有「日」、「月」的字根，因龙喜得日、月为其最爱，可增加肖龙者的内心世界充实感及精华，表一生中非常有才华。
六.宜选用有「星」、「云」、「辰」的字根，因为龙喜行于天空，而与日、月、星、辰为伍，表可得贵人相助。
',
		'ji'=>'属龙之人不喜欢字有人字边，就像被下放人间，古代传说龙不吃肉，也不吃五谷杂粮，也不愿见虎、兔、龙、牛、羊、狗，或有奔跑等字形，持武器字形也不可，不喜有洞穴困住，有木、森林、草字形更不可，如果名字中有以上所举例之字形，就表示名字有破格。
一.属龙之人避免有「廴」、「弓」、「川」、「几」、「巳」、「邑」、「虫」的字根，会有龙降格为蛇之感，由大变小，地位降低很不是味道之意，胆小懦弱无助。
二.属龙之人避免有「宀」、「户」、「门」之字根，因为龙不喜洞穴，有被困住的感觉，怕才能无法发挥。
三.属龙之人避免选用「艹」、「平」、「册」之字根，龙不喜落入草丛，有龙困浅滩之意，怕才能无法发挥。
四.属龙之人避免选用有「田」、「甫」之字根，龙也不喜欢下田，有受困之意，易受人陷害。
五.属龙之人避免选用有「戌」、「成」、「犬」、「国」、「犭」之字根，因辰与戌正冲，犯了正冲，是生肖姓名中的最会与人争执的字根，一生中看不顺眼的人一大堆。
六.属龙之人避免选用有「山」、「丘」、「虍」、「艮」、「寅」的字根，会犯上了「龙虎斗」，一生中容易与人有争执。
七.属龙之人避免选用有小「口」 之字根，会形成「困龙」之意，事业、感情均会被困住。
八.属龙之人避免有「卯」、「兔」之字根，因为「玉兔见龙，云里去」，地支卯辰相害，一生中小人不断。
九.属龙之人避免有「心」、「月」、「忄」之字根，都为「肉」形之意，而龙乃不食人间烟火，荤肉对其而言，更是糟蹋。
十.属龙之人避免选用有「臣」、「士」、「相」、「人」、「小」、「少」、「工」、「卒」之字根，会使龙降格为臣、为士、为人之意，由尊而卑，气势下降，志气会被磨掉。'
	],
	'she'=>[
		'xi'=>'
一.蛇宝宝起名宜选用有“口”、“宀”字首，因蛇喜欢在洞穴内有隐匿之所，并可以栖息、冬眠，在洞穴钻来钻去，悠游自如。洞穴内是其江山。如：容、口、可、呈、吴、周、品、哈、喜、乔、嘉、严、四、回、因、国、园、圆、图、团、宅、安、字、富、宁、宝、宽。
二.蛇宝宝起名宜有“木”之部首，蛇亦喜欢上树，有升格变成龙之意味。如：木、本、杰、杏、杉、材、东、林、松、桐、格、桔、栩、栋、枫、森、柏、荣、桥、树。
三.蛇宝宝起名宜有“乡”、“系”、“衣”、“示”、“采”、“巾”等披彩衣的字首，可转化为龙，有升格意味。如：彤、形、彦、彬、纪、约、纷、维、练、纬、缘、县、绩、缤、祝、祖、市、师、帆、采、释。
四.蛇宝宝起名适宜有“酉”、“丑”的字首，因地支巳酉丑三合。如：酉、羽、西、金、姚、凤、鸣、鹃、鹤、莺、鸾、牡、特、纽、翔、轩、悲、翟、翰。
五.蛇宝宝起名喜有“马”及“羊”字根的字，因地支巳午未为三会，有帮扶的力量。如：马、许、群、喜、祥、翔、姜、妹。
六.蛇宝宝起名适宜有“小”、“少”、“臣”、“士”、“夕”之字根，因蛇之别称为小龙。如：尚、而、尹、士、壮、寿、臣、贤、多。
七蛇宝宝起名适宜有“田”之字根，蛇喜欢在田间活动，田字有四个洞穴，亦有藏身之所的意思。如：田、由、男、界、留、番、画、畸、当、畴、疆、福、思、迪。
八.蛇宝宝起名适宜有蛇形之字根如“辶”、“廴”、“弓”、“走”、“几”、“己”、“虫”、“邑”。如：巴、乾、元、兆、克、延、廷、建、进、逸、道、达、运、远、选、还、迈、郭、邬、邹、郑、邓。
九.蛇宝宝起名适宜有“忄”、“心”、“月”之字根，因为蛇为荤食，喜食肉类，而“心”、“忄”是心脏肉，上等肉之意。如：心、必、志、惠、情、慈、愉、慧、怀、育、肯、胡、脉、膏。
喜用：①卯字根：昴、柳、卿、勉 ②未字根：味、妹、茉 可用：①子字根：李、孙、存、厚、敦 ②丑字根：钮、生、特 蛇宝宝起名',
		'ji'=>'
一.蛇宝宝起名忌有“虎”部字首，因为“虎”与“蛇“为相刑害，古云：蛇遇猛虎似刀戳，盖地支与寅相刑也。如：虎、虔、虚、虞、良、山、邱、丘、岗、仙、峥、嵘，“山”之字根也有虎之意味。
二.蛇宝宝起名忌有“日”之字根，因为蛇怕太阳太热，烤焦其身，蛇大都是在洞穴，树荫下活动，极少暴晒日光下。如：日、晶、旭、旦、早、旨、明、吴、昌、易、映、昀、春、昱、晋、晟、皓、晨、普、晴、智、晖、暖、暄、哗、畅、曜、晓、历。
三蛇宝宝起名忌有“草”之字根，俗称“打草惊蛇”，而蛇如在草丛中活动，虽有游走的空间，但也容易被人发现，嗨哟遭受到风霜雨打，稍觉辛苦。如：芝、芬、芳、花、苗、若、英、茜、荃、荷、莉、蓉、莲、蕊、蕙、萧、薇、薛、兰。
四.蛇宝宝起名忌有“亥”猪的字根，因为地支巳与亥对冲，即蛇与猪冲。如：象、膏、豫、家、毅、聚、缘、朱。
五.蛇宝宝起名忌有“水”、“氵”、“子”之部首字根，因为蛇之地支属火，遇有“水”字根，犯了水火相克之破绽。尤其在字形的左半部或下半边。如：水、永、求、汪、冲、沛、河、治、泉、泰、洋、洞、洪、津、洲、浩、浪、海、深、清、添、游、涣、渊、港、汤、温、源、溪、沧、济、涛、浚。
六.蛇宝宝起名忌有“豆”、“米”累五谷杂粮字根，因为蛇为荤食动物，喜食青蛙等肉类食物，不宜有“豆”等字根，如犯之，则表示其人内心不服输，脾气大，又有失落感，看到食物，却不是自己喜欢吃的食物之故也。如：豆、禾、秀、秋、秉、科、秦、程、积、穆、稼、梁、米、粉、粲、精、黍、麦、黎。
七.蛇宝宝起名忌有“人”的字根，因为蛇不喜欢碰到人，人类是其敌人之一，由亚当、夏娃的故事，人类将蛇代表邪恶，见到就打。如：人、仁、代、仙、仲、任、企、伍、伯、伸、似、布、往、佐、佛、作、佳、依、倩、倪、伟、健、备、杰、傅。
忌用：①巳字根：虫、它、之、弓、几、陀、芝、弟、凡 ②申字根：坤、畅、侯'
	],
	'ma'=>[
		'xi'=>'马喜欢有洞穴住，能披彩衣为佳，能得王又能传令更显高贵，得人骑，表有被照顾，有五谷杂粮，有火边，有太阳，武器，得森林、得草原平地、得奔跑字形，得虎、得狗为三合局，得蛇、得羊为三会局。
一. 宜用有「艹」字根之字，因马为素食动物，有草则头好身壮壮，粮食丰盛，则内心世界充实—名字中如有符合者为好名。
二.喜用有龙之字形，代表「龙马精神」。积极、生气、活力、有干劲，容易成功之意。
三.喜有杂粮之字根如「禾」、「麦」、「叔」、「稷」、「豆」、「粟」、「梁」。因马除了喜食草以外，五谷杂粮亦为其主食，表一生衣食无缺。
四.喜有「木」字根，因马在林间来去自如，有树木也可以遮阳，表悠游自在，能适应各种环境。
五.喜用有「宀」、「冖」、「广」、「门」、「册」之字形，表示有屋檐，洞穴可遮风避雨，表有一个温暖的家。
六.喜用有「系」、「巾」、「彡」、「衣」、「疋」、「采」之部首，好马方能被人披上彩衣。带冠有：「亠」、「爫」有头角征峥嵘，有被尊敬的感觉。
七.马喜有三合之字根，如「寅」、「戌」及三会的字根，如「已」、「未」，表贵人增多',
		'ji'=>'属马之人不宜有肉字边，碰到老鼠成六冲，遇牛则成六害，遇水字形则成水火相克，最好不要见山，会太劳累，如果名字中有以上所举例之字形，就表示名字有破格。
一. 属马之人名字不宜有两个人的字根，如「ㄔ」，因为好马不配双鞍，如犯之，则为无节之马，不忠、不贞、滥情、情愁。
二.属马之人名字不宜见到「心」、「月」、「忄」之字根，因其代表荤食，而马为素食动物，表示看得到吃不到，一生为生活打拼。
三.属马之人名字不宜有「子」、「壬」、「冫」、「癸」、「北」之字根，容易有水火相冲，因马为火，不宜选用有水之字形，否则生活中会冲突不断。
四.属马之人名字不宜有「田」、「甫」、「车」字根之字，表示淘汰的马有委曲求全，还被人嫌，当做下田耕种用的工具，表会劳苦ㄧ生。五.属马之人名字不宜有「山」之字根，因马在山路跑，相当辛苦，一生辛苦经营收获却不多。
六.属马之人名字姓名三个字中，不宜见到两个口或双日，因两口马形成一「骂」字，容易招人嫌，是非多，衰运连连，做事不顺。
七.属马之人名字不宜见到有「牛」、「丑」，因为自古青牛遇白马，不战而逃，因小人不断。
八.属马之人名有「又」、「入」、「ㄦ」字形，有心猿意马脚开开为病马，表福德不定。'
	],
	'yang'=>[
		'xi'=>'羊喜欢有洞穴住，得人疼，有五谷吃，有太阳晒，又能得森林及草原或平地，当然能得木字形也不错，如得兔或得猪即成三合局，如得蛇或得马即成三会局，如得栅栏得宜家—名字中如有符合下述条件者为好名。
一. 羊喜有「木」、「未」( 土中藏火 ) 之字根，因木可遮荫亦有依靠，一生贵人很多。
二.羊喜有大「口」、「宀」、「门」、「广」、「户」之字样，即有洞穴可休息，可得温饱。
三. 羊有跪乳习惯，喜见有 「几」之字根，表此生能知恩图报，为人谦卑。
四.羊喜有三合或三会的字根，如三合之字根有「豕」与「卯」，三会之字根有「蛇」（巳）与「马」（午）表一生多贵人助。
五. 羊喜吃草，故有「艹」字根者，对属羊者大有帮助，因能得温饱。
六.羊亦喜五谷杂粮，因羊为素食动物，喜有「米」、「麦」、「禾」、「豆」、「稷」、「叔」字根，表能得温饱，一生工作顺利。',
		'ji'=>'属羊之人不宜有肉字边，碰到老鼠成六害，碰到牛成六冲，碰狗或龙成天罗地网，披彩衣太漂亮怕被宰，如见王掌权易惹人怨，遇奔跑字形会怕事，有武器字形不妥，见水字形影响健康，如果名字中有以上所举例之字形，就表示名字有破格。
一. 属羊之人不喜见到对冲的生肖如「丑」、「牛」及相害的生肖「鼠」、「子」之字根，因刑克较重，表示一生小人不断。
二.属羊之人不宜见到天罗地网的字，因「辰」为天罗、「末」为地网，同理亦不宜见到「戌」、「犬」，即「辰」、「戌」、「丑」、「末」均不宜见到，一生理想施展不开。
三.属羊之人不喜见到「示」部字根，有如当祭品供奉用，一生奉献委屈而得不到赞赏，因羊在中国为主要的三牲之祭物。
四.属羊之人不宜见到有彩衣之类字根，如「巾」、「衣」、「系」、「采」、「日」、「光」，因为羊如果披上彩衣、加冠、华丽其身时，就表示即将成为供品了，当三牲之礼也。
五.属羊之人不宜有「心」、「月」、「忄」之字根，因羊为素食动物，见到肉类荤食，内心不充实，有失落、失意之感，看得到的肉，却不是自己喜欢的粮食，内心定会苦闷郁卒。
六.属羊之人不喜有「大」、「王」、「帝」、「君」、「长」之字根，羊为三牲之一，羊长大了容易被用来当祭品、供品，意味牺牲、奉献，为别人而活，一生将会很辛苦。
七.属羊之人不喜见到有「水」、「北」、「子」、「亥」之字根，因为羊是所有动物中最不喜爱喝水的。如果水喝多了，容易新陈代谢不良，故会影响其行运、健康、财运。
八.属羊之人其也不喜之字形如「刀」、「皿」、「金」、「酉」、「车」等，有怕被伤害的感觉，内心充满不安的感觉。'
	],
	'hou'=>[
		'xi'=>'猴喜欢有洞穴住，见人喜开口，如有森林得乐趣，如得草原平地更爽，有木字形或披彩衣显高贵，见王能掌权，跟鼠或龙成三合局，得鸡得狗成三会局—名字中有符合下述条件者为好名。
一. 属猴之人宜有大「口」、「冖」、「宀」之字形，意谓「美猴洞」，猴性喜在洞穴休息得安逸享福，一生中可得上司、长辈照顾。
二.属猴之人最好有「木」之字根，猴子在林间，采食水果，来去自如，荡来荡去，好不悠哉，生中工作，事业会很顺利，因木得其所也。
三.属猴之人喜有彩衣部，「巾」、「纟」、「采」、「衣」、「示」可华丽其身，更为人模人样提高其地位。
四.属猴之人喜头戴王冠，两脚站直，如「升」、「走」、「立」、「亠」、「爫」，表一生让人看得起。
五. 属猴之人乐见有 「人」或「言」、「日」之字根，因为猴子喜欢模仿人类的动作，即「人模人样」，爱做秀、表演，所以名字中有「ㄔ」或「人」或「言」字形均佳，因很得人缘。
六.属猴之人喜有「王」字形，因猴子喜称王，但在称王的过程中必须身经百战，猴王得来不易，又随时会易主，故猴子称王有喜亦有忧，如太强出头会招人怨。
七.属猴之人喜欢三合 ( 申、子、辰 ) 之字根，即 「子」、「水」、「辰」 字形，三合之帮扶力量较大，显得贵人多。',
		'ji'=>'属猴之人不宜有肉字边，不要有五谷字形，与虎为伍为六冲，与猪会形成六害，如有武器字形就会怕，如果名字中有以上所举例之字形，就表示名字有破格。
一. 生肖属猴之人不喜有「对冲」之字，如寅与申冲，「寅」、「艮」、「处」虎字形，则最不利于生肖属猴者，表一生挫败不断。
二.生肖属猴之人不喜见有「豕」、「辶」、「巳」猪字形，因六害之故，即「猪遇猿猴似箭投」，表一生中抱怨很多，因刑克很重的原故。三.生肖属猴之人不喜有「金」、「酉」、「西」、「兑」、「皿」、「鸟」、「月」之字形，因以上字形皆有西方「金」之意，然而，在五行中，金与金相聚，易有刑克，争执，人际关系如果处理不当，一生中会被当成仇人看待，反而不能得其比和之助。
四.生肖属猴之人不喜见有「禾」、「谷」、「田」、「麦」、「稷」、「米」之字形，因猴子喜欢作贱五谷，有句话说：「大猴损五谷」，意味在田间的猴子，只会践踏、玩弄五谷杂粮罢了，工作是赚得少花得多，表示浪费挥霍之意。
五.其它如见大「口」有被关住之感，能力无法发挥。另外「皮」、「力」、「刀」、「君」、「将」，亦为猴不喜用之字，因猴不喜太烦重的工作。
六.猴遇有耳朵 ( 郁 ) 的字根，会有被控制而不自由的感觉'
	],
	'ji'=>[
		'xi'=>'鸡喜欢有洞穴住，或在森林得草原平地跑跳，如有五谷字形，可得温饱，能披彩衣更佳，能见王戴冠显高贵，与蛇跟牛成三合局，得栅栏可受保护—名字中如有符合下述条件者为好名。
一.属鸡之人喜「小」之字形及抬头之字义，因小鸡可爱，鸡长大，大都被人宰食。再者，健康之鸡，大都能抬头，昂首阔步，表一生中工作愉快。
二.属鸡之人喜有「冖」、「宀」、「口」、「广」、「门」之字形，意味鸡在洞穴，屋檐下可遮风避雨，有保护作用，表一生工作顺利，得贵人助。
三.属鸡之人喜有蛇跟牛成三合「巳、酉、丑」之字根，一生贵人相助。
四. 喜有龙凤等字形，有六合升格变凤凰，一生会有高知名度。
五.喜欢武器，代表喙及爪子可以寻得好工作及好事业。
六.鸡喜有「禾」、「豆」、「米」、「梁」、「麦」之字根，因鸡的食物五谷杂粮，整天都在找粮食，见到杂粮，欢心鼓舞，所以有以上字根，对肖鸡之人，内心是充实饱满。
七.属鸡之人喜用有「山」、「爫」、「亠」之字形，为鸡上山头，可展其英姿，有凤凰之象，提升其格局地位，为人受器重。
八.属鸡之人喜见用「彡」、「采」、「系」之字形，「彡」字形为鸡的羽毛漂亮，即增加其人缘，及「采」的字形，即代表鸡冠漂亮，冠冕加身之意，雄纠纠，气昂昂。
九.因鸡喜欢「金鸡独立」如「干」、「平」、「华」，代表脚很健康，单脚就可站立。所以肖鸡之人喜有「金鸡独立」的字形，一生中能单挑大梁。',
		'ji'=>'属鸡之人不宜有肉字边，不喜见人字边，或见二个太阳 ( 日
)，或有奔跑交叉等字形，遇兔字形成六冲，遇狗字形成六害，遇武器字形怕被伤害，如果名字中有以上所举例之字形，就表示名字有破格。一.生肖属鸡之人不喜有「大」、「君」、「帝」、「王」之字形，因鸡长大往往被当做祭品，或为人食用，一生多为别人付出多。牺牲小我，完成大我，真是吃力不讨好。
二.生肖属鸡之人不喜有字形脚分开者，因为鸡的脚如果分开，代表病鸡，不健康也。鸡能够金鸡独立最佳，不喜见到分叉的脚。如「ㄦ」、「ㄙ」、「入」、「乂」，如有此字形要注意身体健康。
三.生肖属鸡之人不喜见到有「犬」、「犭」、「戌」之字形，因「犬」与「犭」、「戌」为狗之意，因地支酉与戌为六害，古云：「金鸡遇犬，泪双流」，意味狗会追咬鸡，鸡犬不宁之意，表平常会惹事生非。
四.生肖属鸡之人不宜见有太多「口」之名字，容易七嘴八舌，成为长舌妇，鸡婆也，好管闲事，易生是非及吃力不讨好。
五.其它：肖鸡之人亦不喜见有「刀」、「系」、「示」、「力」、「石」、「人」、「虍」、「手」、「示」、「酉」、「血」、「氵」、「水」、「冫」、「子」、「亥」、「北」之字形，因为代表一生付出多而收获少。
六.生肖属鸡之人最怕见到与其对冲之字形，因鸡为酉，卯与酉对冲，所以凡是有「卯」、「东」之字形或字义均不可犯之，如犯之，则伤害大，刑伤、生病难免。卯之字义可推及东方之日，兔均属之。
七.生肖属鸡之人不喜再见到「金」之字形，因鸡为酉金，但五行中，金与金组合过重，容易犯冲，金属肃杀之意，「金」之字意还有「西」、「兑」、「申」、「秋」、「酉」均属之，表一生中与人冲突不断。
八.生肖属鸡之人不喜见到有「心」、「月」、「忄」之字形，因以上之字形代表肉的意思，但鸡为素食动物，不食荤肉，若给其肉食，会让其内心不服输，不满意，失望但又无可奈何。'
	],
	'gou'=>[
		'xi'=>'狗喜欢有洞穴住，能披彩衣为佳，能得王掌权最佳，又戴冠，有肉可吃饱，得虎得马成三合局，有栅栏可住得舒服—名字中如有符合下述条件者为好名。
一. 属狗之人喜欢有三合之字根，狗为戌，「寅、午、戌」为三合的助力，对人的帮助很大，人缘、贵人运都很好。
二.属狗之人喜有「心」、「忄」、「月」之字形皆为肉形，因狗喜欢吃肉，正合狗意，内心粮食丰富，充实，生活优渥，能快乐生活。
三.其它：肖狗之人亦喜欢有「小」、「少」、「士」、「臣」之字形，因比较得人疼，为人不强势。
四.戴冠迈步走：「亠」、「爫」、「走」、「跑」有此字形，代表一生中容易出头天。
五.狗是最忠于人的动物，属狗之人喜有「亻」、「人」、「入」之字形，表示有主人，并忠于主人，忠于事业，忠于爱情，忠于钱财，因此容易成功。
六.狗喜披漂亮的彩衣，有威风之味，可增加其威势，更能提升地位。如字形是「彡」、「采」、「系」、「巾」、「衣」均是，一生中会让人家看得起。
七.属狗之人喜有「宀」、「冖」、「门」、「广」之字形，意味家庭内的狗，比较好命，有主人疼，有房子住，不必去当流浪狗。',
		'ji'=>'狗不吃五谷杂粮，也不喜见太阳，如遇鸡则成六害，如遇龙则成六冲，遇武器字形易受伤害，如遇开口字形怕伤害人，如果名字中有以上所举例之字形，就表示名字有破格。
一.狗喜忠于人，但如果一只狗要同时侍奉几个人，则成为不忠之狗，如名字中见到有两个人的字形即是。「彳」为人想，一心多用，最后恐一事无成。
二.肖狗之人不喜有「田」之字形，因为狗在田间，喜欢践踏五谷，浪费，不惜福之意，有好吃懒做的感觉。
三.古云：「金鸡遇犬泪双流」，所以肖狗之人亦不宜见到有鸡之字形，如「酉」、「隹「兆」、「鸟」、「羽」、「兑」、「西」、「金」等字均有鸡之意，表示会被陷害。
四.肖狗之人不宜见有「木」形之字，因狗为戌土，由于木克土，所以字形如有木边，则犯上了木克土，被压抑住，力量无从发挥。
五.肖狗之人最不喜见到其对冲之字形，如辰戌对冲，龙与狗对冲，龙即为「辰」，所以千万避免使用有「辰」字根之字为名字，有表常会与人有冲突。
六.肖狗之人不宜见有「水」、「冫」、「子」、「北」、「亥」之属于水之字根，因狗为戌土，土会克水，对其不利，伤害大，会泄漏精力、财气、健康。
七.狗不喜素食、五谷杂粮类，狗为荤食动物。「示」、「衤」字边不行，因狗肉不上桌也。
八.肖狗之人不喜有两个口之字，或姓名中合起来有两个口，容易形成「两口犬」为一「哭」的不祥，凡事不顺，如为三口犬则成为「疯狗」，如有一口之犬称「吠」，喜欢多管闲事，所以对肖狗之人，最好不需有「口」之字形。
九.肖狗之人不喜有日旁，狗见到「日」，有一句话说「狗吠日」，狗看到太阳出来也要乱叫两声，意指爱管闲事，大嘴巴，徒劳无功。'
	],
	'zhu'=>[
		'xi'=>'卯兔未羊三合：柳、勉、村、月、善、義、洋、妹 ……
子鼠丑牛三会：李、孝、学、孺、享、生、産、特、浩、钮 ……
五谷得食：禾、科、秦、程、穜、稼、穗、粉、精、麦、鼓、豊、碗……
以小、翘脚得位：小、士、臣、少、允、法、私、芸、松……
洞穴得地：宇、安、宜、宋、家、宏、廣、開、康、寛……
金水相生比旺：金、锰、钧、钿、録、铢、锐、永、汝、江、沂、沅、法、泉、津、流、……
以木暗合：本、材、松、株、桔、栋、柳、楷、桂、荣、树……',
		'ji'=>'巳蛇正冲：虹、蜀、蜿、萤、引、张、建、延、连、造、起、迅，婉，凯，迎，近，返，迪，迷，通，造，速，逢，逸，运，游，道，达，远，迁，选，还，迈，邑，廷，巡，迪，廷，川，州，华，平，一，三，之，乙，也，虹，蛾，蜜，蝶，融，弘，弦，强，发，纪……
逢亥猪自刑刑克：孩、家、象、豪、綠……
逢寅虎相破刑克：虔、彪、演、琥、盧、爐……
逢申猴相害刑克：申、伸、绅、畅、袁、猴……
逢大、王牺牲刑克：大、天、夫、太、奇、尊、冠、令、玉、琥、玲、珍、瑰、琳王，琴，玫，琐，玖，珠，班，理，球，玻，瑜，瑟，瑞，莹，玛，瑾，璇，瑗，璋，环，奇，奚，长，君，群，将，帅，主……
逢人批彩衣牺牲刑克：仁、仕、仲、任、佑、伦、信、修、衣、衫、翡、彦、彩、彰、纠、纹、约、紘、绸、彤、形、常、帷、帧、希、……
逢肉不得食刑克：心、忠、思、恁、惠、慈、怡、性、恆、憶、肯、股……
逢山刑伤刑克：屹、岩、峰、岳、崎、峥、崔……
逢土逢火相克刑克：在、地、圳、奎、均、坎、城、坤、基、堆、炎、烈、烟、煌、烊、照……'
	]
];